{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Layer",
      "config": {
        "name": "layer_1",
        "trainable": true,
        "batch_input_shape": [
          null,
          3,
          360,
          480
        ],
        "dtype": "float32"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_1",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_1",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_1",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_1",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_2",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_2",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_2",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_2",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_3",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_3",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_3",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_3",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_4",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_4",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_4",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_5",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_5",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_5",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_1",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_6",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_6",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_6",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_2",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_7",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_7",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_7",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_3",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_8",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_first"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_8",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_8",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_9",
        "trainable": true,
        "filters": 12,
        "kernel_size": [
          1,
          1
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_first",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Reshape",
      "config": {
        "name": "reshape_1",
        "trainable": true,
        "batch_input_shape": [
          null,
          12,
          360,
          480
        ],
        "dtype": "float32",
        "target_shape": [
          12,
          172800
        ]
      }
    },
    {
      "class_name": "Permute",
      "config": {
        "name": "permute_1",
        "trainable": true,
        "dims": [
          2,
          1
        ]
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "trainable": true,
        "activation": "softmax"
      }
    }
  ],
  "keras_version": "2.1.6",
  "backend": "tensorflow"
}